#### Terraform Format and Style 🖌`failure`
#### alpha - Terraform Initialization ⚙️`success`
#### alpha - Terraform Validation 🤖Success! The configuration is valid.


#### alpha - Terraform Plan 📖`success`

<details><summary>alpha - Show Plan</summary>

```terraform
module.enable-services.google_project_service.serviceusage[0]: Refreshing state... [id=terra-datarepo-alpha/serviceusage.googleapis.com]
module.enable-services.google_project_service.cloudresourcemanager[0]: Refreshing state... [id=terra-datarepo-alpha/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.required-services[14]: Refreshing state... [id=terra-datarepo-alpha/stackdriver.googleapis.com]
module.enable-services.google_project_service.required-services[7]: Refreshing state... [id=terra-datarepo-alpha/sql-component.googleapis.com]
module.enable-services.google_project_service.required-services[16]: Refreshing state... [id=terra-datarepo-alpha/cloudkms.googleapis.com]
module.enable-services.google_project_service.required-services[6]: Refreshing state... [id=terra-datarepo-alpha/dns.googleapis.com]
module.enable-services.google_project_service.required-services[0]: Refreshing state... [id=terra-datarepo-alpha/iamcredentials.googleapis.com]
module.enable-services.google_project_service.required-services[10]: Refreshing state... [id=terra-datarepo-alpha/container.googleapis.com]
module.enable-services.google_project_service.required-services[15]: Refreshing state... [id=terra-datarepo-alpha/logging.googleapis.com]
module.enable-services.google_project_service.required-services[1]: Refreshing state... [id=terra-datarepo-alpha/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.required-services[11]: Refreshing state... [id=terra-datarepo-alpha/storage-api.googleapis.com]
module.enable-services.google_project_service.required-services[2]: Refreshing state... [id=terra-datarepo-alpha/serviceusage.googleapis.com]
module.enable-services.google_project_service.required-services[12]: Refreshing state... [id=terra-datarepo-alpha/storage-component.googleapis.com]
module.enable-services.google_project_service.required-services[5]: Refreshing state... [id=terra-datarepo-alpha/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[9]: Refreshing state... [id=terra-datarepo-alpha/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[4]: Refreshing state... [id=terra-datarepo-alpha/compute.googleapis.com]
module.enable-services.google_project_service.required-services[8]: Refreshing state... [id=terra-datarepo-alpha/monitoring.googleapis.com]
module.enable-services.google_project_service.required-services[3]: Refreshing state... [id=terra-datarepo-alpha/genomics.googleapis.com]
module.enable-services.google_project_service.required-services[13]: Refreshing state... [id=terra-datarepo-alpha/servicenetworking.googleapis.com]
module.core-infrastructure.google_compute_ssl_policy.global-ssl-policy: Refreshing state... [id=projects/terra-datarepo-alpha/global/sslPolicies/global-ssl-policy]
module.core-infrastructure.google_compute_address.nat-address[1]: Refreshing state... [id=projects/terra-datarepo-alpha/regions/us-central1/addresses/nat-external-1]
module.core-infrastructure.google_service_account.node_pool: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/gke-node-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.core-infrastructure.google_compute_address.nat-address[0]: Refreshing state... [id=projects/terra-datarepo-alpha/regions/us-central1/addresses/nat-external-0]
module.core-infrastructure.google_compute_network.network[0]: Refreshing state... [id=projects/terra-datarepo-alpha/global/networks/alpha-network]
module.core-infrastructure.google_kms_key_ring.db: Refreshing state... [id=projects/terra-datarepo-alpha/locations/us-central1/keyRings/jade-db]
module.core-infrastructure.module.cloud-armor.google_compute_security_policy.policy: Refreshing state... [id=projects/terra-datarepo-alpha/global/securityPolicies/broad-cloud-armor]
module.core-infrastructure.google_project_iam_member.node_pool[0]: Refreshing state... [id=terra-datarepo-alpha/roles/monitoring.viewer/serviceaccount:gke-node-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[1]: Refreshing state... [id=terra-datarepo-alpha/roles/monitoring.metricWriter/serviceaccount:gke-node-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[3]: Refreshing state... [id=terra-datarepo-alpha/roles/container.admin/serviceaccount:gke-node-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[2]: Refreshing state... [id=terra-datarepo-alpha/roles/logging.logWriter/serviceaccount:gke-node-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[5]: Refreshing state... [id=terra-datarepo-alpha/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:gke-node-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[4]: Refreshing state... [id=terra-datarepo-alpha/roles/compute.admin/serviceaccount:gke-node-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.core-infrastructure.google_kms_crypto_key.db: Refreshing state... [id=projects/terra-datarepo-alpha/locations/us-central1/keyRings/jade-db/cryptoKeys/jade]
module.core-infrastructure.google_project_iam_binding.kubernetes_engine_kms_access: Refreshing state... [id=terra-datarepo-alpha/roles/cloudkms.cryptoKeyEncrypterDecrypter]
module.core-infrastructure.google_compute_subnetwork.subnetwork[0]: Refreshing state... [id=projects/terra-datarepo-alpha/regions/us-central1/subnetworks/alpha-subnet]
module.core-infrastructure.google_compute_router.router[0]: Refreshing state... [id=projects/terra-datarepo-alpha/regions/us-central1/routers/router]
module.core-infrastructure.module.k8s-master.google_container_cluster.cluster: Refreshing state... [id=projects/terra-datarepo-alpha/locations/us-central1/clusters/jade-master-us-central1]
module.core-infrastructure.google_compute_router_nat.nat[0]: Refreshing state... [id=terra-datarepo-alpha/us-central1/router/nat-1]
module.core-infrastructure.module.k8s-cis-nodes-highmem["jade-node-us-central-1"].google_container_node_pool.pool[0]: Refreshing state... [id=projects/terra-datarepo-alpha/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-1-cis-highmem]
module.datarepo-app.google_service_account.datarepo_api_sa[0]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.google_compute_global_address.private_ip_address[0]: Refreshing state... [id=projects/terra-datarepo-alpha/global/addresses/datarepo-db-jade-private-address]
module.datarepo-app.google_compute_global_address.global_ip_address: Refreshing state... [id=projects/terra-datarepo-alpha/global/addresses/jade-alpha-ip]
module.datarepo-app.module.sql_workloadid.google_service_account.service-account: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-sqlproxy@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.random_id.cloudsql_id[0]: Refreshing state... [id=ZrUTW1MjlVw]
module.datarepo-app.google_service_account.datarepo_test_runner_sa[0]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo-stairway"]: Refreshing state... [id=QUxyb72Vy09NqFV4S6907g]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo"]: Refreshing state... [id=aSD7KqGHxMSyFzonU_-vVA]
module.datarepo-app.module.cloudsql.random_id.root_user_password[0]: Refreshing state... [id=4QU0qQ1b9O7mxK6_dgfFww]
module.datarepo-app.google_project_iam_member.api_sa_role[2]: Refreshing state... [id=terra-datarepo-alpha/roles/datastore.user/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[6]: Refreshing state... [id=terra-datarepo-alpha/roles/servicemanagement.serviceController/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[8]: Refreshing state... [id=terra-datarepo-alpha/roles/storage.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[11]: Refreshing state... [id=terra-datarepo-alpha/roles/resourcemanager.projectIamAdmin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[1]: Refreshing state... [id=terra-datarepo-alpha/roles/cloudsql.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[10]: Refreshing state... [id=terra-datarepo-alpha/roles/container.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.api_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com/keys/62d19e5653cbd6ddb5851e6273e5b4224f82c2ef]
module.datarepo-app.google_project_iam_member.api_sa_role[0]: Refreshing state... [id=terra-datarepo-alpha/roles/bigquery.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[7]: Refreshing state... [id=terra-datarepo-alpha/roles/stackdriver.accounts.viewer/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[9]: Refreshing state... [id=terra-datarepo-alpha/roles/pubsub.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[4]: Refreshing state... [id=terra-datarepo-alpha/roles/logging.logWriter/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[3]: Refreshing state... [id=terra-datarepo-alpha/roles/errorreporting.writer/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[5]: Refreshing state... [id=terra-datarepo-alpha/roles/monitoring.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.test_runner_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com/keys/e596a28bf46f6806575db7d21a0898d1bdf65d80]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[0]: Refreshing state... [id=terra-datarepo-alpha/roles/container.admin/serviceaccount:datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[1]: Refreshing state... [id=terra-datarepo-alpha/roles/logging.viewer/serviceaccount:datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[2]: Refreshing state... [id=terra-datarepo-alpha/roles/monitoring.viewer/serviceaccount:datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.module.sql_workloadid.google_project_iam_member.service-account-role["roles/cloudsql.client"]: Refreshing state... [id=terra-datarepo-alpha/roles/cloudsql.client/serviceaccount:datarepo-jade-sqlproxy@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[3]: Refreshing state... [id=terra-datarepo-alpha/roles/secretmanager.admin/serviceaccount:datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.module.sql_workloadid.google_service_account_iam_binding.workload-identity-binding: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-sqlproxy@terra-datarepo-alpha.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-app.module.cloudsql.google_service_networking_connection.private_vpc_connection[0]: Refreshing state... [id=https%3A%2F%2Fwww.googleapis.com%2Fcompute%2Fv1%2Fprojects%2Fterra-datarepo-alpha%2Fglobal%2Fnetworks%2Falpha-network:servicenetworking.googleapis.com]
module.datarepo-app.vault_generic_secret.api_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/alpha/datarepo-api-sa]
module.datarepo-app.vault_generic_secret.test_runner_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/alpha/test-runner-sa]
module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0]: Refreshing state... [id=datarepo-db-jade-66b5135b5323955c]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo-stairway"]: Refreshing state... [id=projects/terra-datarepo-alpha/instances/datarepo-db-jade-66b5135b5323955c/databases/stairway]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo"]: Refreshing state... [id=drmanager//datarepo-db-jade-66b5135b5323955c]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo"]: Refreshing state... [id=projects/terra-datarepo-alpha/instances/datarepo-db-jade-66b5135b5323955c/databases/datarepo]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo-stairway"]: Refreshing state... [id=drmanager//datarepo-db-jade-66b5135b5323955c]
module.datarepo-app.module.cloudsql.google_sql_user.root_user[0]: Refreshing state... [id=root//datarepo-db-jade-66b5135b5323955c]
module.datarepo-app.vault_generic_secret.sql_db_password[0]: Refreshing state... [id=secret/dsde/datarepo/alpha/datarepo-sql-db]
module.datarepo-alerts.google_compute_global_address.global_ip_address_grafana: Refreshing state... [id=projects/terra-datarepo-alpha/global/addresses/datarepo-grafana-ip]
module.datarepo-alerts.module.uptimecheck.google_monitoring_uptime_check_config.uptime-check-config[0]: Refreshing state... [id=projects/terra-datarepo-alpha/uptimeCheckConfigs/data-alpha-envs-terra-bio]
module.datarepo-alerts.google_compute_global_address.global_ip_address_prometheus: Refreshing state... [id=projects/terra-datarepo-alpha/global/addresses/datarepo-prometheus-ip]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account.service-account: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0]: Refreshing state... [id=projects/terra-datarepo-alpha/notificationChannels/13640375975922639159]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.admin"]: Refreshing state... [id=terra-datarepo-alpha/roles/monitoring.admin/serviceaccount:prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_iam_binding.workload-identity-binding: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.metricWriter"]: Refreshing state... [id=terra-datarepo-alpha/roles/monitoring.metricWriter/serviceaccount:prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/logging.admin"]: Refreshing state... [id=terra-datarepo-alpha/roles/logging.admin/serviceaccount:prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.node_resource_alerts: Refreshing state... [id=projects/terra-datarepo-alpha/alertPolicies/9870185772218155901]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_health_alert: Refreshing state... [id=projects/terra-datarepo-alpha/alertPolicies/8295498595022934880]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_memory_util: Refreshing state... [id=projects/terra-datarepo-alpha/alertPolicies/15172991372362375938]
module.datarepo-alerts.module.uptimecheck.google_monitoring_alert_policy.uptime-check[0]: Refreshing state... [id=projects/terra-datarepo-alpha/alertPolicies/1005569643174588287]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.core-infrastructure.google_project_iam_member.node_pool[5] will be created
  + resource "google_project_iam_member" "node_pool" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:gke-node-sa@terra-datarepo-alpha.iam.gserviceaccount.com"
      + project = "terra-datarepo-alpha"
      + role    = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      ~ data             = (sensitive value)
      ~ data_json        = (sensitive value)
      ~ id               = "secret/suitable/terraform/stackdriver/slack-token" -> (known after apply)
      ~ lease_duration   = 2764800 -> (known after apply)
      + lease_id         = (known after apply)
      ~ lease_renewable  = false -> (known after apply)
      ~ lease_start_time = "RFC9999" -> (known after apply)
      - version          = -1 -> null
        # (1 unchanged attribute hidden)
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "notification_channel" {
        id           = "projects/terra-datarepo-alpha/notificationChannels/13640375975922639159"
      ~ labels       = {
          - "auth_token"   = "xoxb-12729891575-1301495169890-SUYNuZWXKWTdFGkT4W07MfGg"
          - "channel_name" = "#jade-alerts"
        } -> (known after apply)
        name         = "projects/terra-datarepo-alpha/notificationChannels/13640375975922639159"
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @samanehsan, Action: `pull_request`, Working Directory: `./datarepo`, Workflow: `Terraform Plan`*